<template>
  <DefaultMainContainer title="會員服務條款">
    <div class="member">
      <h3 class="member__heading">會員服務條款</h3>
      <div class="member__subheading">
        <p>
          歡迎您使用『STAYFUN企業福委APP』及『STAYFUN企業福委網站(Web)』平台，本平台係由『鼎恒數位科技股份有限公司』(下稱本公司)所經營及建置或委託他人建置者，以提供『訊息牆』、『調查所』、『逛特約』及『好好買』服務(以下合稱
          本服務)。本服務條款訂立的目的，是為了保護所有付款機構、使用者與合作特約店家、合作店家/廠商的利益，並構成本公司與使用者間的契約或類似契約行為，所有之本服務均是依據本服務條款所提供，任何使用者使用本服務時，請先詳細閱讀本服務條款與「隱私權政策」及其他本公司網站（網址：http://www.mayohr.com）公布的相關條款（以下合稱本公司條款），並請確實遵守；若您無法遵守本公司條款內容、或對於本服務條款內容全部或部分不同意時，請勿使用本服務及其相關服務。本服務一經使用即表示您已知悉、並完全同意本公司條款所有約定。為確保您的權益，建議您經常主動確認相關條款的最新條文內容。
          若您是法律上的無行為能力人或限制行為能力人(如未滿二十歲的未成年人)，則您使用本服務時，請將本服務條款交由您的法定代理人(如父母、輔助人或監護人)閱讀，並得到其同意，您才可使用本服務。當您開始使用本服務時，則表示您及您的法定代理人(如父母、輔助人或監護人)均已經閱讀、了解並同意受本服務條款拘束。除法令另有規定外，本服務條款之效力與書面文件相同。本公司保留就本服務在依業務推展及評估消費者需求等因素下得以增加、修改或終止本服務內容之權利。
        </p>
      </div>
      <h4 class="member__title">一、服務說明</h4>
      <h5 class="member__subtitle">(一)銷售服務</h5>
      <div class="member__content">
        <p>
          在您安裝本服務後，本公司將提供合作店家/廠商優惠訊息、優惠商品及票券銷售服務，在台灣每個主要城市，每天提供店家優惠券活動等吃喝玩樂的店家。您可以單純瀏覽不需要填寫付款資料，只有當您決定要購買優惠時，才需填寫信用卡（下稱付款信用卡）號、收件人、連絡電話及收件地址等基本資料。
        </p>
      </div>
      <h5 class="member__subtitle">(二)電子報及EDM發送</h5>
      <div class="member__content">
        <p>
          在您加入會員後，視為您已同意本公司得不定期發送電子報或商品訊息(EDM)至您所登錄的電子信箱。若您欲訂閱、停止訂閱、修改電子報或商品訊息的訂閱內容，請向【客服中心】提出申請。
        </p>
      </div>
      <h5 class="member__subtitle">(三)WEB瀏覽器要求</h5>
      <div class="member__content">
        <p>
          為了讓您享受到最佳的使用體驗，我們推薦您使用Chrome或Internet Explorer
          11以上瀏覽器，減少使用時可能會有誤差狀況，導致功能異常。請務必更新您的瀏覽器至上述版本，或切換您的瀏覽器至以上2種，即可解決操作問題。
        </p>
      </div>
      <h4 class="member__title">二、使用者義務</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            在使用本服務過程中，您必須提供本服務之註冊與開通作業、因購買商品或服務所需之您的手機號碼、信用卡號及其他個人資料及資訊，並應擔保您所提供的所有資料及個人資訊，都是真實、正確、現有且完整，以便本公司順利完成本服務。您所提供之資料及個人資訊若有變動，應立即向本公司主動更新。若因您所提供之資料及個人資訊有非真實、非正確、未更新或不完整等因素，致本公司對您無法全部或一部完成本服務者，應由您自行承擔全部損失，本公司不因此承擔任何責任，如本公司因此受有損害，亦須由您負責。
          </li>
          <li>
            您應確保所使用手機及其資訊系統之安全，防止非法入侵、取得、竄改、毀損其中紀錄或資料之情形發生，並應安裝使用本服務所必須之軟體、韌體或其他程式碼及更新。如因任何原因，致個人手機有前述非法入侵等情事致您使用本服務而受有損害或損失者，將由您自行承擔。本公司會依法採取相關措施，以保障您個人資料的安全，但不擔保您所填寫的資料在網路傳輸中的正確性，如果您發現有錯誤，請立即通知本公司，否則本公司將以獲取之資料內容，辦理相關作業。
          </li>
          <li>
            使用者利用或使用本服務應依各頁面的指示操作，如有任何問題，除有特別狀況、規定者外，將可享受完整購買商品或優惠服務。
          </li>
        </ul>
      </div>
      <h4 class="member__title">三、交易行為與使用者行為</h4>
      <p class="member__subtitle">您同意遵守相關法令規範及以下條款：</p>
      <h4 class="member__subtitle">(一) 「逛特約」之 特約商店服務</h4>
      <div class="member__content">
        <p>
          本公司並非您所購買之商品或服務之提供者或賣方。本服務僅係為您提供至合作/特約店家進行消費之相關優惠權益內容，供您日後若決定進行商品或服務消費時，得在出示優惠證明之前主動告知合作/特約店家之優惠方案。您與合作/特約店家間如有任何糾紛或有退換貨需求者，須由您自行與合作/特約店家協商，並應由合作/特約店家自行負擔相關法律責任，與本公司無涉。
        </p>
      </div>
      <h4 class="member__subtitle">
        (二) 「逛特約」之『STAYFUN即享券』銷售服務
      </h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            請您務必確認該商品或服務皆符合您的需求才下單購買，以免影響己身及其他使用者購買的權益。若您於本服務訂購產品或服務後，經本公司判斷您有疑似盜刷帳戶或任何本公司認為非誠信交易等情事，本公司將視情況拒絕交易、暫停或永久終止對您提供本服務。
          </li>
          <li>
            您購買後，如因不符合您的需求，在未使用之情況下，除特殊商品或服務依各檔次有例外規定或特別約定外，您可透過STAYFUN客服中心
            或使用APP申請退還商品/服務及退費。此部分本服務退款方式如下：(1)
            您使用福利點數之部分:退還福利點數於STAYFUN網路平台端。(2)您以信用卡付款之部分:本公司將依信用卡公司之退費流程處理，退款將退至您下一期信用卡帳單。為了維護您的權利，本公司保有調整退貨、退款條件及機制，建議您隨時至STAYFUN客服中心
            確認，亦請您確實完成退貨退費流程，並靜心等待本公司完成退款事宜。
          </li>
          <li>
            本公司採封閉式企業會員制度，所有銷售的商品、服務的優惠兌換券或票券，皆與您的帳號綁定，故您所購買的兌換券、序號應妥善保存；如有遺失、遭盜用情形或其他情形導致已經第三人使用者，應由您自行承擔風險，本公司無法恢復核銷為未使用狀態，另實體票券因採非記名式，如發生遺失、被竊或滅失等情事，恕不補發。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">(三)共通條款</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            您使用本服務所支付款項將以新臺幣支付，如支付之貨幣非為新臺幣而涉及匯率換算時，將由付款信用卡發卡銀行依其所使用之匯率，進行換算。
          </li>
          <li>
            您使用本服務之消費行為或交易，皆以本公司電腦系統所自動記錄的電子交易資料為準，如遇爭議時，您同意應以本公司電子交易資料為認定標準。若您發現交易資料有誤，應立即通知本公司。
          </li>
          <li>
            請您填寫真實且正確的付款信用卡資料，若有不實或任何有未經持卡人許可有盜刷或偽冒信用卡等情形時，本公司有權立即暫停或永久終止您使用本服務，如經本公司判斷涉及違法情事者，本公司有權向司法警察機關提供相關訊息及依法追究。
          </li>
          <li>
            若您使用本服務過程中，經本公司或本服務系統判斷您有遲交信用卡帳單、信用額度不足、付款信用卡使用異常或其他付款信用卡發卡銀行可能拒絕付款之情事、違反本服務條款、任何本公司認為不恰當或異常等情事，本公司將視情況拒絕該次交易、暫停或永久終止對您提供本服務。
          </li>
          <li>
            您同意依STAYFUN點數使用規定來使用您帳號之點數。如本公司查獲銷售的商品或服務及您獲得的STAYFUN點數，有大量轉賣第三者使用、透過第三方代購(非直接向本公司購買)、有其它營利、投機取巧的行為，對於您上述行為所致之任何商品或服務的爭議，均與本公司無涉，本公司不對您或其他第三人負有任何形式賠償或補償的責任或義務。
          </li>
          <li>
            如有違反以下情事者，本公司得暫停或終止提供本公司所有或部分服務（含本服務）予您，如果致本公司或代表人、代理人、員工等受有損害，本公司有權依法追究並請求因此衍生之商譽損失、律師費、裁判費等損失：
            <ul class="member__sublist">
              <li>
                您不得有任何妨礙或干擾本服務及其相關系統(下稱本服務系統)，或其他使用者使用本服務的行為。
              </li>
              <li>
                您不得有複製或改製本服務或本服務系統及其等相關內容如圖片、文字等之行為。
              </li>
              <li>您不得有其他不符合本服務所提供使用目的的行為。</li>
              <li>
                您不得有破壞及干擾本服務所提供的各項資料、功能（例如：您以探試密碼或任何其它之非法手段，未經授權進入本服務相關之任何部份或畫面、與本服務系統或本公司伺服器連結之系統、網路，或透過該系統、網路提供之服務；探查、掃描或測試本服務系統的弱點；破壞本服務或與其連結之網路安全或認證措施；使用本服務以回覆查詢、追蹤或找尋任何關於本服務其他使用者或本公司之訪客、顧客；於本服務或本服務系統中，探索您個人資訊以外之其他相關資訊），或以任何方式侵入、試圖侵入、破壞本服務或本服務系統，或藉由本服務作任何侵害或破壞行為（例如：對本服務或與本服務系統，傳送不合理或不成比例之大量資料）。
              </li>
              <li>
                您不得利用本服務從事洗錢、詐欺等犯罪行為、不法行為，或基於違法目的使用本服務。
              </li>
              <li>
                在取得、使用本服務或本服務系統過程中，您不得提交虛偽之身份或信用卡資料；亦不得提交他人的信用卡資料或以他人手機為所使用手機。
              </li>
              <li>
                您不得操控本服務之識別功能，偽造傳送至本服務或與本服務系統連結之訊息。
              </li>
              <li>您不得假冒或無權代理/代表他人，使用本服務或本服務系統。</li>
            </ul>
          </li>
          <li>
            如您有違反本服務條款之任何行為或其他涉及到您不正當利用、使用之情況，且有第三人因此對本公司提出主張或請求，而造成本公司受損害時，應由您承擔賠償責任，包括本公司之人員、代理人、合作夥伴或其他相關人員因此所受之損害，包括但不限於律師費、裁判費、和解金等。
          </li>
          <li>
            您應妥善保管所使用手機、付款信用卡、本服務之帳號資料、付款密碼，並不得轉讓、質借或提供他人使用，否則因此所生之糾紛或損失，需由您自行負擔。如您遺失所使用手機、特約信用卡或其他與本服務相關之資料，請您務必依以下方式辦理：
            <ul class="member__sublist">
              <li>
                您應於知悉上開情形後即時通知本公司，俾利本公司受通知後暫停您帳號之使用。
              </li>
              <li>
                若經本公司自主判斷有上開情形或您的付款密碼可能被冒用，或可能非您本人或非經您授權而使用本服務之交易，將立即通知您並暫停該帳號所指示之付款行為。
              </li>
              <li>
                於您前述通知以後所發生的損失，將由本公司負擔（但依據您與付款信用卡發卡銀行之約定由您負擔之損失，仍將由您負擔）；於此之前所發生的損失，除可歸責於本公司所產生者，您需自行負擔全部損失。
              </li>
              <li>
                如因掛失等原因、其他付款信用卡發卡銀行可能拒絕付款之情事，您應停止使用本服務，或提供其他得使用之信用卡。如有前揭情形但您仍繼續使用，本公司得暫停或終止提供本公司所有或部分本服務；如本公司有受損害，亦有權依法追究。
              </li>
            </ul>
          </li>
          <li>
            如您為使用本服務發生支付錯誤的情形，依以下原則辦理：
            <ul class="member__sublist">
              <li>
                因可歸責於本公司之事由而發生支付錯誤時，本公司將於知悉時，立即更正，並同時通知您。
              </li>
              <li>
                因可歸責於您之事由，或因您使用之機器設備、網路而發生支付錯誤時，您須承擔該筆支付錯誤金額，但本公司於接獲您的通知後，在合理商業範圍內提供協助，惟此非本公司之義務。
              </li>
              <li>
                因不可歸責於您及本公司之事由，但可歸責於第三方發生支付錯誤時，本公司將協助進行更正，並提供其他必要之協助。
              </li>
              <li>
                如依據您與信用卡發卡銀行之約定，該筆支付錯誤金額須由您負擔時，您須承擔該筆支付錯誤金額。
              </li>
            </ul>
          </li>
          <li>使用本服務時，您同意優先使用福利點數進行款項支付。</li>
          <li>
            一旦您有離職之事實，您的帳號將於本公司與您原任職公司之人資單位進行確認後，由本公司依以下方式辦理:
            <ul class="member__sublist" style="padding: 0;">
              <li>
                註銷您註冊之帳戶:若您的帳戶內，已無剩餘任何福利點數者，本公司將直接註銷您的帳戶，您無法繼續使用本服務。
              </li>
              <li>
                保留您帳戶至福利點數消耗完畢為止:
                若您的帳戶內，尚有福利點數之餘額者，您仍可繼續使用本服務至福利點數消耗完畢為止，並繼續適用本服務條款。
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="member__content">
        <p>
          則惟不論如何，您帳戶註銷前因使用本服務所產生之付款義務(包括福利點數或刷卡)，您仍應履行無論如何，您瞭解且同意，所有經由您透過手機而使用本服務進行付款時，無須使用簽帳單、當場簽名或另簽署書面契約，您不得僅以未簽名為理由，拒繳應付款項。
        </p>
      </div>
      <h4 class="member__subtitle">四、兒童及青少年保護</h4>
      <div class="member__content">
        <p>
          本公司為保護兒童及青少年勿觸及不當資訊，將盡力把關所提供內容屬性無涉限制級，惟因資訊眾多，難免有不適合於兒童與青少年資訊存在，為保護兒童及青少年受到不當資訊的影響，除可主動通知本公司調整不適當的資訊外，父母或監護人亦須盡到下列義務：
        </p>
        <ul class="member__list">
          <li>
            對於十二歲以上未滿十八歲的青少年，應避免其接觸本服務中含有暴力、色情或鼓勵犯罪等資訊的內容。
          </li>
          <li>
            未滿十二歲的兒童，應全程陪同其使用所使用手機，以避免兒童接觸到不當資訊。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">五、關於STAYFUN的合作特約店家、廠商廣告</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            本服務如有提供合作/特約店家、廠商之描述，其中內容資料均為合作/特約店家、廠商所提供，如與實際狀況不符的情形，實非本公司所願，應由該合作/特約店家、廠商自行負責，本公司將協助您與合作/特約店家、廠商處理。
          </li>
          <li>
            就您使用本服務而連結到其他商城平台或其他網站所為之任何交易(導購)，若日後針對商品或服務衍生爭議或疑問者，係由該商城平台或其他網站負責人負責，與本公司無涉。惟本公司在合理範圍內會提供協助，此非本公司之義務。您在決定使用本服務而連結到其他商城平台或其他網站為任何交易前，應仔細評估交易條件和商品/服務之內容是否符合需求，以確保自身權益。
            <p>
              就透過本服務而連結到之其他商城平台或其他網站之內容，包含圖片、影音、文字等，均是由各該商城平台或其他網站自行處理、負責，與本公司無涉。本公司與該等商城平台或網站均屬獨立之組織。
            </p>
          </li>
          <li>
            本服務得連結至其他獨立第三人之網站，此等網站非由本公司所設置，與本公司無涉，本公司就不負擔任何法律責任。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">六、競業使用限制</h4>
      <div class="member__content">
        <p>
          不論您是否為提供與本服務相同或類似服務的業者，在未經本公司同意授權前，請勿將本服務全部或部分資料，如合作/特約店家、廠商銷售頁面資訊等，以任何方式進行重製、編輯、公開傳輸、改作、連結等行為，或其他可能使使用者誤認您與本服務或本公司間有授權關係或合作關係存在的方式利用。
        </p>
      </div>
      <h4 class="member__subtitle">七、智慧財產權</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            本服務中，就本公司直接所提供的服務，包括所有圖片、內文、網站架設、頁面設計、架構、商標等，均受智慧財產權、商標及相關法律保護，在未取得本公司書面同意前，使用者不得擅自使用、重製、複製、抄襲、授權或轉授權部分或全部本服務之內容，若有違反將依法提出刑民事訴訟，絕不寬貸。
          </li>
          <li>
            由於本公司相當注重著作權、商標、專利等相關法律，本公司會要求合作/特約店家、廠商就其所提供予本服務內之資料、圖片等均有合法權源，不得有侵害第三人權利之情事。若您使用本服務時有發現合作/特約店家、廠商有圖片、內文、影片、商標、專利等侵權情形，請與STAYFUN客服中心聯繫，本公司將會儘速向合作/特約店家、合作店家/廠商釐清，如為真實，會立即移除爭議內容。關於非可歸責本公司之侵權行為，您也理解本公司也為受害者，本公司將主動通知合作/特約店家、廠商處理，本公司不介入權利人與合作/特約店家、廠商之侵權紛爭。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">八、責任限制</h4>
      <div class="member__content">
        <p>
          對於本公司所提供的本服務及資訊，均僅依該服務當時的功能及現況提供使用；對於使用者之特定要求或需求，包括但不限於速度、安全性、可靠性、完整性、正確性及不會斷線和出錯等，本公司不負任何形式或內容之擔保或保證責任。本公司不保證您使用本服務可免於病毒感染或不具破壞性，並聲明無任何明示或暗示之保證，包括但不限於本服務內容正確性、無侵害權利及其適用性或不會遭第三人惡意入侵等事項。
        </p>
      </div>
      <div class="member__content">
        <ul class="member__list">
          <li>
            若您對於本服務或其內容有任何不滿意，您可隨時停止使用本服務。
          </li>
          <li>
            除法律另有規定外，本公司對於任何間接性、持續性、衍生性或懲罰性違約金之賠害賠償，包括所失利益，不負任何責任。
          </li>
          <li>
            本公司若因您使用本服務或其內容之事項而應負有賠償責任者，本公司之責任，在任何情況下，將以產生該責任之相關交易金額為上限。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">九、服務暫停或中斷</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            本服務因系統或功能『例行性』的維護或變動或優化，可能會發生服務暫停或中斷，您理解並同意此為使用本服務會發生之狀況之一。本公司將於該暫停或中斷前以公告或其他適當方式告知，您同意本公司不須因此負損害賠償責任。
          </li>
          <li>
            除另有約定外，在下列情形，本公司亦將暫停或中斷本服務的全部或部份，且對使用者任何直接或間接的損害，均不負任何責任：

            <ul class="member__sublist">
              <li>
                經本公司判斷合作/特約店家廠商商品或服務有侵害使用者的可能或風險時。
              </li>
              <li>
                經本公司判斷合作/特約店家、/廠商之商品或服務易造成消費爭議時。
              </li>
              <li>
                對本服務或本服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時。
              </li>
              <li>
                天災或其他不可抗力或本公司之第三方服務者(如雲端提供者等)或合作/特約店家、合作店家/廠商之因素，所致的服務全部或部份之停止或中斷。
              </li>
              <li>
                其他任何不可歸責於本公司的事由所致的服務全部或部份之停止或中斷。
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">十、修改本服務條款的權利</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>
            本公司保留隨時修改本服務條款的權利，修改後的本服務條款將公佈官網、APP，請您隨時留意。
          </li>
          <li>
            當您使用本服務而按下同意鍵或繼續使用本服務時，即視為您已同意該等修改。
          </li>
          <li>本服務條款與各項標題的名稱，其用詞僅在於方便理解辨識。</li>
          <li>本服務條款所訂的全部或部份無效時，不影響其他有效條款的效力。</li>
          <li>
            本服務條款如有未盡事宜，依您提供用於付款信用卡發卡銀行之約定條款或商業習慣或相關法令辦理。
          </li>
        </ul>
      </div>
      <h4 class="member__subtitle">十一、準據法及管轄權</h4>
      <div class="member__content">
        <ul class="member__list">
          <li>本服務條款的解釋、補充及適用均以中華民國法令為準據法。</li>
          <li>
            因本服務條款所發生的訴訟，以臺灣新竹地方法院為第一審管轄法院。
          </li>
        </ul>
      </div>
    </div>
  </DefaultMainContainer>
</template>
<script lang="ts">
import { Component, Vue } from 'nuxt-property-decorator'
import DefaultMainContainer from '~/components/DefaultMainContainer.vue'

@Component({
  layout: 'default',
  middleware: 'auth',
  components: {
    DefaultMainContainer
  }
})
export default class Policies extends Vue {}
</script>
<style lang="scss" scoped>
@import '../assets/scss/utils/variables';

.member {
  font-size: 1rem;
  line-height: 1.7;
  &__heading,
  &__subheading,
  &__content,
  &__title,
  &__subtitle,
  &__sublist {
    padding-bottom: $spacing-xxl;
  }
  &__heading,
  &__title,
  &__subtitle {
    font-weight: 800;
    font-size: 1rem;
  }
  &__list {
    list-style: decimal;
    list-style-position: inside;
    p {
      padding-top: $spacing-l;
      padding-bottom: $spacing-l;
    }
  }
  &__sublist {
    list-style-type: disc;
    list-style-position: inside;
    margin-left: $spacing-xxxl;
  }
}
</style>
